const initialState = {
  data: [
    {
      category: "pizza",
      products: [
        {
          image: "",
          title: "Барбекюm",
          description:
            "Томатный соус, говядина, маслины булочка гамбургер, соленые...",
          price: "От 74 000 сумов",
        },
        {
          image: "",
          title: "Барбекюnop",
          description:
            "Томатный соус, говядина, маслины булочка гамбургер, соленые...",
          price: "От 74 000 сумов",
        },
        {
          image: "",
          title: "Барбекюpo",
          description:
            "Томатный соус, говядина, маслины булочка гамбургер, соленые...",
          price: "От 74 000 сумов",
        },
        {
          image: "",
          title: "Барбекюsz",
          description:
            "Томатный соус, говядина, маслины булочка гамбургер, соленые...",
          price: "От 74 000 сумов",
        },
        {
          image: "",
          title: "Барбекюmu",
          description:
            "Томатный соус, говядина, маслины булочка гамбургер, соленые...",
          price: "От 74 000 сумов",
        },
        {
          image: "",
          title: "Барбекюny",
          description:
            "Томатный соус, говядина, маслины булочка гамбургер, соленые...",
          price: "От 74 000 сумов",
        },
        {
          image: "",
          title: "Барбекюt",
          description:
            "Томатный соус, говядина, маслины булочка гамбургер, соленые...",
          price: "От 74 000 сумов",
        },
        {
          image: "",
          title: "Барбекюse",
          description:
            "Томатный соус, говядина, маслины булочка гамбургер, соленые...",
          price: "От 74 000 сумов",
        },
        {
          image: "",
          title: "Барбекюmv",
          description:
            "Томатный соус, говядина, маслины булочка гамбургер, соленые...",
          price: "От 74 000 сумов",
        },
        {
          image: "",
          title: "Барбекюnee",
          description:
            "Томатный соус, говядина, маслины булочка гамбургер, соленые...",
          price: "От 74 000 сумов",
        },
      ],
    },
    {
      category: "pasta",
      products: [
        {
          image: "",
          title: "Барбекюmw",
          description:
            "Томатный соус, говядина, маслины булочка гамбургер, соленые...",
          price: "От 74 000 сумов",
        },
        {
          image: "",
          title: "Барбекюnaa",
          description:
            "Томатный соус, говядина, маслины булочка гамбургер, соленые...",
          price: "От 74 000 сумов",
        },
      ],
    },
    {
      category: "salat",
      products: [
        {
          image: "",
          title: "Барбекюmk",
          description:
            "Томатный соус, говядина, маслины булочка гамбургер, соленые...",
          price: "От 74 000 сумов",
        },
        {
          image: "",
          title: "Барбекюnn",
          description:
            "Томатный соус, говядина, маслины булочка гамбургер, соленые...",
          price: "От 74 000 сумов",
        },
      ],
    },
  ],
};

export const productsReducer = (state = initialState, action) => {
  switch (action.type) {
    case "":
      return "";
    default:
      return state;
  }
};
